public/last_soap_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://impl.soap.ws.crane.hititcs.com/"><SOAP-ENV:Body><ns1:CreateBooking><AirBookingRequest><clientInformation><clientIP>129.0.0.1</clientIP><member>true</member><password>Pia123</password><preferredCurrency>PKR</preferredCurrency><userName>PSA27463822</userName></clientInformation><airItinerary><adviceCodeSegmentExist>true</adviceCodeSegmentExist><bookOriginDestinationOptions><bookOriginDestinationOptionList><bookFlightSegmentList><actionCode>NN</actionCode><addOnSegment>false</addOnSegment><bookingClass><cabin>ECONOMY</cabin><resBookDesigCode>L</resBookDesigCode><resBookDesigQuantity>9</resBookDesigQuantity></bookingClass><fareInfo><cabinClassCode>Y</cabinClassCode><fareBaggageAllowance><allowanceType>WEIGHT</allowanceType><maxAllowedPieces>0</maxAllowedPieces><maxAllowedWeight><unitOfMeasureCode>KG</unitOfMeasureCode><weight>20</weight></maxAllowedWeight></fareBaggageAllowance><fareGroupName>ECO</fareGroupName><fareReferenceCode>LOW1</fareReferenceCode><fareReferenceID>00e77e9cd0dd0c9ee617d0736dac2b33b9a18843d31adb07ce8cbd02a75ca6060a2a281006d0a7dec454e05fc84a1cb0282e7cf64b79a9fbd10437b89dd74d1b136d312d185bb53d8a686f6137825b073041fb90a584d16205948721321fbf1e46c5275d99bc7cc9f341813732d3b0</fareReferenceID><fareReferenceName>LOW1</fareReferenceName><flightSegmentSequence>1</flightSegmentSequence><notValidAfter>2024-07-30T00:00:00+05:00</notValidAfter><notValidBefore>2024-07-30T00:00:00+05:00</notValidBefore><resBookDesigCode>L</resBookDesigCode></fareInfo><flightSegment><airline><code>PK</code><companyFullName>PAKISTAN AIRLINES</companyFullName><companyShortName>PAKISTAN AIRLINES</companyShortName></airline><arrivalAirport><cityInfo><city><locationCode>KHI</locationCode><locationName>Karachi</locationName><locationNameLanguage>EN</locationNameLanguage></city><country><locationCode>PK</locationCode><locationName>Pakistan</locationName><locationNameLanguage>EN</locationNameLanguage><currency><code>USD</code></currency></country></cityInfo><codeContext>IATA</codeContext><language>EN</language><locationCode>KHI</locationCode><locationName>Karachi</locationName><terminal></terminal></arrivalAirport><arrivalDateTime>2024-07-30T11:55:00+05:00</arrivalDateTime><arrivalDateTimeUTC>2024-07-30T06:55:00+05:00</arrivalDateTimeUTC><departureAirport><cityInfo><city><locationCode>ISB</locationCode><locationName>Islamabad</locationName><locationNameLanguage>EN</locationNameLanguage></city><country><locationCode>PK</locationCode><locationName>Pakistan</locationName><locationNameLanguage>EN</locationNameLanguage><currency><code>USD</code></currency></country></cityInfo><codeContext>IATA</codeContext><language>EN</language><locationCode>ISB</locationCode><locationName>Islamabad</locationName><terminal></terminal></departureAirport><departureDateTime>2024-07-30T10:00:00+05:00</departureDateTime><departureDateTimeUTC>2024-07-30T05:00:00+05:00</departureDateTimeUTC><flightNumber>301</flightNumber><ondControlled>false</ondControlled><sector>DOMESTIC</sector><codeshare>false</codeshare><distance>0</distance><equipment><airEquipType>320</airEquipType><airEquipTypeModel>32S</airEquipTypeModel><changeofGauge>false</changeofGauge></equipment><flightNotes><deiCode>7</deiCode><explanation>Meal Service</explanation><note>S</note></flightNotes><flownMileageQty>699</flownMileageQty><iatciFlight>false</iatciFlight><journeyDuration>PT1H55M</journeyDuration><onTimeRate>0</onTimeRate><secureFlightDataRequired>false</secureFlightDataRequired><stopQuantity>0</stopQuantity></flightSegment><involuntaryPermissionGiven>true</involuntaryPermissionGiven><sequenceNumber>0</sequenceNumber></bookFlightSegmentList></bookOriginDestinationOptionList></bookOriginDestinationOptions></airItinerary><airTravelerList><accompaniedByInfant>false</accompaniedByInfant><birthDate>1992-05-09</birthDate><contactPerson><email><email>hamid22401@gmail.com</email><markedForSendingRezInfo>false</markedForSendingRezInfo><preferred>false</preferred><shareMarketInd>false</shareMarketInd></email><personName><givenName>Hamid</givenName><shareMarketInd>false</shareMarketInd><surname>Hussain</surname></personName><phoneNumber><areaCode>532</areaCode><countryCode>+92</countryCode><markedForSendingRezInfo>false</markedForSendingRezInfo><preferred>false</preferred><shareMarketInd>false</shareMarketInd><subscriberNumber>03349112041</subscriberNumber></phoneNumber><shareContactInfo>true</shareContactInfo><shareMarketInd>true</shareMarketInd><socialSecurityNumber>33333333330</socialSecurityNumber><useForInvoicing>false</useForInvoicing></contactPerson><gender>M</gender><hasStrecher>false</hasStrecher><parentSequence>0</parentSequence><passengerTypeCode>ADLT</passengerTypeCode><personName><givenName>Hamid</givenName><shareMarketInd>false</shareMarketInd><surname>Hussain</surname></personName><requestedSeatCount>1</requestedSeatCount><shareMarketInd>false</shareMarketInd><unaccompaniedMinor>false</unaccompaniedMinor></airTravelerList><contactInfoList><adress><countryCode>PK</countryCode><formatted>false</formatted><preferred>false</preferred><shareMarketInd>false</shareMarketInd></adress><email><email>hamid22401@gmail.com</email><markedForSendingRezInfo>false</markedForSendingRezInfo><preferred>false</preferred><shareMarketInd>false</shareMarketInd></email><personName><givenName>HAMID</givenName><shareMarketInd>false</shareMarketInd><surname>AFRIDI</surname></personName><phoneNumber><areaCode>321</areaCode><countryCode>+92</countryCode><markedForSendingRezInfo>false</markedForSendingRezInfo><preferred>false</preferred><shareMarketInd>false</shareMarketInd><subscriberNumber>9112041</subscriberNumber></phoneNumber><shareContactInfo>false</shareContactInfo><shareMarketInd>false</shareMarketInd><useForInvoicing>false</useForInvoicing></contactInfoList><infantWithSeatCount>0</infantWithSeatCount><requestPurpose>MODIFY_PERMANENTLY_AND_CALC</requestPurpose><specialRequestDetails><otherServiceInformations><otherServiceInformationList><airTravelerSequence>0</airTravelerSequence><code>OSI</code><explanation>CTCB 92 334 9112041</explanation><flightSegmentSequence>0</flightSegmentSequence></otherServiceInformationList><otherServiceInformationList><airTravelerSequence>0</airTravelerSequence><code>OSI</code><explanation>CTCE HAMID22401@GMAIL.COM</explanation><flightSegmentSequence>0</flightSegmentSequence></otherServiceInformationList></otherServiceInformations></specialRequestDetails></AirBookingRequest></ns1:CreateBooking></SOAP-ENV:Body></SOAP-ENV:Envelope>
